zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysint.c
/***************************************************************************//**
* \file  cy_sysint.c
* \version 1.150
*
* \brief
* Provides an API implementation of the SysInt driver.
*
********************************************************************************
* \copyright
* (c) 2016-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_M4CPUSS) || defined (CY_IP_M7CPUSS)

#include "cy_sysint.h"

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 8.4', 1, 'Intentionally, the prototype and definition are in the same place.')
#if defined (CY_IP_M7CPUSS) || (defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS_VERSION == 2u) && (CPUSS_SYSTEM_IRQ_PRESENT)) || defined (CY_DOXYGEN)
__WEAK cy_israddress * Cy_SysInt_SystemIrqUserTableRamPointer = NULL;
#endif /* defined (CY_IP_M7CPUSS) || (defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS_VERSION == 2u) && (CPUSS_SYSTEM_IRQ_PRESENT)) || defined (CY_DOXYGEN) */
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 8.4')

CY_MISRA_FP_BLOCK_START('MISRA C-2012 Rule 8.3', 1, 'Only one prototype will be picked for compilation')
#if (((CY_CPU_CORTEX_M0P) || defined (CY_IP_M7CPUSS) || defined (CY_M4CPUSS_V2_IRQ_MUXING) || defined (CY_DOXYGEN)) && !defined(CY_IP_M0SECCPUSS))
void Cy_SysInt_SetNmiSource(cy_en_sysint_nmi_t nmiNum, cy_en_intr_t intrSrc)
#else
void Cy_SysInt_SetNmiSource(cy_en_sysint_nmi_t nmiNum, IRQn_Type intrSrc)
#endif
{
    CY_ASSERT_L3(CY_SYSINT_IS_NMI_NUM_VALID(nmiNum));

#if (defined(CY_IP_M4CPUSS) && (CY_CPU_CORTEX_M0P))
    CY_ASSERT_L1(CY_SYSINT_IS_PC_0);
#endif

#if defined (CY_IP_M4CPUSS)
    if (CY_CPUSS_V1)
    {
        nmiNum = CY_SYSINT_NMI1; /* For CPUSS_ver1 the NMI number is 1 */
    }
#endif

    #if (CY_CPU_CORTEX_M0P)
        CPUSS_CM0_NMI_CTL((uint32_t)nmiNum - 1UL) = (uint32_t)intrSrc;
    #elif (CY_CPU_CORTEX_M4)
        CPUSS_CM4_NMI_CTL((uint32_t)nmiNum - 1UL) = (uint32_t)intrSrc;
    #else
        #if (CY_IP_M7CPUSS_VERSION == 2)
        if (0UL != CY_IS_CM7_CORE_3)
        {
            CPUSS_CM7_3_NMI_CTL((uint32_t)nmiNum - 1UL) = (uint32_t)intrSrc;
        } 
        else if (0UL != CY_IS_CM7_CORE_2)
        {
            CPUSS_CM7_2_NMI_CTL((uint32_t)nmiNum - 1UL) = (uint32_t)intrSrc;
        } else
        #endif /* (CY_IP_M7CPUSS_VERSION == 2) */
        if (0UL != CY_IS_CM7_CORE_0)
        {
            CPUSS_CM7_0_NMI_CTL((uint32_t)nmiNum - 1UL) = (uint32_t)intrSrc;
        }
        else
        {
            CPUSS_CM7_1_NMI_CTL((uint32_t)nmiNum - 1UL) = (uint32_t)intrSrc;
        }
    #endif
}

#if (((CY_CPU_CORTEX_M0P) || defined(CY_IP_M7CPUSS) || defined(CY_M4CPUSS_V2_IRQ_MUXING) || defined (CY_DOXYGEN)) && !defined(CY_IP_M0SECCPUSS))
cy_en_intr_t Cy_SysInt_GetNmiSource(cy_en_sysint_nmi_t nmiNum)
#else
IRQn_Type Cy_SysInt_GetNmiSource(cy_en_sysint_nmi_t nmiNum)
#endif
{
    CY_ASSERT_L3(CY_SYSINT_IS_NMI_NUM_VALID(nmiNum));

#if (defined(CY_IP_M4CPUSS) && (CY_CPU_CORTEX_M0P))
    if (CY_CPUSS_V1)
    {
        nmiNum = CY_SYSINT_NMI1; /* For CPUSS_ver1 the NMI number is 1 */
    }
#endif

#if (CY_CPU_CORTEX_M0P)
    return ((cy_en_intr_t)(CPUSS_CM0_NMI_CTL((uint32_t)nmiNum - 1UL)));
#elif (CY_CPU_CORTEX_M4)
    #if defined (CY_M4CPUSS_V2_IRQ_MUXING)
    return ((cy_en_intr_t)(CPUSS_CM4_NMI_CTL((uint32_t)nmiNum - 1UL)));
    #else
    return ((IRQn_Type)(CPUSS_CM4_NMI_CTL((uint32_t)nmiNum - 1UL)));
    #endif
#else
    #if (CY_IP_M7CPUSS_VERSION == 2)
    if (0UL != CY_IS_CM7_CORE_3)
    {
        return ((cy_en_intr_t)(CPUSS_CM7_3_NMI_CTL((uint32_t)nmiNum - 1UL)));
    }
    else if (0UL != CY_IS_CM7_CORE_2)
    {
        return ((cy_en_intr_t)(CPUSS_CM7_2_NMI_CTL((uint32_t)nmiNum - 1UL)));
    } else 
    #endif /* (CY_IP_M7CPUSS_VERSION == 2) */
    if (0UL != CY_IS_CM7_CORE_0)
    {
        return ((cy_en_intr_t)(CPUSS_CM7_0_NMI_CTL((uint32_t)nmiNum - 1UL)));
    }
    else
    {
        return ((cy_en_intr_t)(CPUSS_CM7_1_NMI_CTL((uint32_t)nmiNum - 1UL)));
    }
#endif
}
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 8.3')

cy_en_sysint_status_t Cy_SysInt_Init(const cy_stc_sysint_t* config, cy_israddress userIsr)
{
    cy_en_sysint_status_t status = CY_SYSINT_SUCCESS;

    if(NULL != config)
    {
        CY_ASSERT_L3(CY_SYSINT_IS_PRIORITY_VALID(config->intrPriority));

    #if defined (CY_IP_M4CPUSS) && !defined (CY_M4CPUSS_V2_IRQ_MUXING)
        #if (CY_CPU_CORTEX_M0P)
            (void)userIsr; /* Suppress a compiler warning about unused variables */
            if (config->intrSrc > SysTick_IRQn)
            {
                Cy_SysInt_SetInterruptSource(config->intrSrc, config->cm0pSrc);
                NVIC_SetPriority((IRQn_Type)(config->intrSrc), config->intrPriority);

            #if (defined (CPUSS_SYSTEM_IRQ_PRESENT) && (CPUSS_SYSTEM_IRQ_PRESENT == 1u))
                (void)Cy_SysInt_SetSystemIrqVector(((cy_en_intr_t)config->cm0pSrc), userIsr);
            #else
                /* Set the new vector only if it was moved to __ramVectors */
                if (SCB->VTOR == (uint32_t)&__ramVectors)
                {
                    (void)Cy_SysInt_SetVector(config->intrSrc, userIsr);
                }
            #endif /* (defined (CPUSS_SYSTEM_IRQ_PRESENT) && (CPUSS_SYSTEM_IRQ_PRESENT == 1u)) */
            }
            else
            {
                status = CY_SYSINT_BAD_PARAM;

                NVIC_SetPriority((IRQn_Type)(config->cm0pSrc), config->intrPriority);
                /* Set the new vector only if it was moved to __ramVectors */
                if (SCB->VTOR == (uint32_t)&__ramVectors)
                {
                    (void)Cy_SysInt_SetVector(config->intrSrc, userIsr);
                }
            }
        #elif (defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS_VERSION == 2) && (CPUSS_SYSTEM_IRQ_PRESENT))
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to IRQn_Type enum.');
            IRQn_Type IRQn = (IRQn_Type)((uint32_t)config->intrSrc >> CY_SYSINT_INTRSRC_MUXIRQ_SHIFT); /* Fetch bit 12-15 to get CPU IRQ value */
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_intr_t enum.');
            cy_en_intr_t devIntrSrc = (cy_en_intr_t)((uint32_t)config->intrSrc & CY_SYSINT_INTRSRC_MASK); /* Fetch bit 0-11 to get system interrupt value */
            CY_ASSERT_L3(CY_SYSINT_IS_PRIORITY_VALID(config->intrPriority));
            if (IRQn > SysTick_IRQn && IRQn < Internal0_IRQn)
            {
                Cy_SysInt_SetInterruptSource(IRQn, devIntrSrc);

                NVIC_SetPriority(IRQn, config->intrPriority);

