zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysint.c
                (void)Cy_SysInt_SetSystemIrqVector(devIntrSrc, userIsr);
            }
            else
            {
                status = CY_SYSINT_BAD_PARAM;

                /* Set the new vector only if it was moved to __ramVectors */
                if (SCB->VTOR == (uint32_t)&__ramVectors)
                {
                    (void)Cy_SysInt_SetVector(config->intrSrc, userIsr);
                }
            }
        #else
            {
                NVIC_SetPriority(config->intrSrc, config->intrPriority);

                /* Set the new vector only if it was moved to __ramVectors */
                if (SCB->VTOR == (uint32_t)&__ramVectors)
                {
                    (void)Cy_SysInt_SetVector(config->intrSrc, userIsr);
                }
            }
        #endif /* (CY_CPU_CORTEX_M0P) */
    #endif /* defined (CY_IP_M4CPUSS) */

    #if defined (CY_IP_M7CPUSS) || (defined (CY_IP_M4CPUSS) && defined(CY_M4CPUSS_V2_IRQ_MUXING))
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to IRQn_Type enum.');
        IRQn_Type IRQn = (IRQn_Type)((uint32_t)config->intrSrc >> CY_SYSINT_INTRSRC_MUXIRQ_SHIFT) ; /* Fetch bit 16-31 to get CPU IRQ value */
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_intr_t enum.');
        cy_en_intr_t devIntrSrc = (cy_en_intr_t)((uint32_t)config->intrSrc & CY_SYSINT_INTRSRC_MASK); /* Fetch bit 0-15 to get system interrupt value */
        CY_ASSERT_L3(CY_SYSINT_IS_PRIORITY_VALID(config->intrPriority));
    #if (CY_CPU_CORTEX_M0P)
        if (IRQn > NvicMux1_IRQn && IRQn < Internal0_IRQn) /* CPU IRQ0 and IRQ1 for CM0+ are used by ROM and not meant for user. */
    #else
        if (IRQn > SysTick_IRQn && IRQn < Internal0_IRQn)
    #endif
        {
            Cy_SysInt_SetInterruptSource(IRQn, devIntrSrc);
        }
        else
        {
            status = CY_SYSINT_BAD_PARAM;
        }

        NVIC_SetPriority(IRQn, config->intrPriority);

    #if (defined (CPUSS_SYSTEM_IRQ_PRESENT) && (CPUSS_SYSTEM_IRQ_PRESENT == 1u))
        (void)Cy_SysInt_SetSystemIrqVector(devIntrSrc, userIsr);
    #endif /* (defined (CPUSS_SYSTEM_IRQ_PRESENT) && (CPUSS_SYSTEM_IRQ_PRESENT == 1u)) */
    #endif /* defined (CY_IP_M7CPUSS) */
    }
    else
    {
        status = CY_SYSINT_BAD_PARAM;
    }

    return(status);
}

#if (((CY_CPU_CORTEX_M0P) || defined (CY_IP_M7CPUSS) || (defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS_VERSION == 2) && (CPUSS_SYSTEM_IRQ_PRESENT)) || defined (CY_DOXYGEN)) && !defined(CY_IP_M0SECCPUSS))
void Cy_SysInt_SetInterruptSource(IRQn_Type IRQn, cy_en_intr_t devIntrSrc)
{
#if defined (CY_IP_M4CPUSS)
    if (CY_CPUSS_V1)
    {
        uint32_t regPos = ((uint32_t)IRQn >> CY_SYSINT_CM0P_MUX_SHIFT);
        if(0UL == (regPos & (uint32_t)~CY_SYSINT_MUX_REG_MSK))
        {
            uint32_t bitfield_Pos = (uint32_t)((uint32_t)IRQn - (uint32_t)(regPos << CY_SYSINT_CM0P_MUX_SHIFT)) << CY_SYSINT_CM0P_MUX_SCALE;
            uint32_t bitfield_Msk = (uint32_t)(CY_SYSINT_CM0P_MUX_MASK << bitfield_Pos);

            CY_REG32_CLR_SET(CPUSS_CM0_INT_CTL[regPos], bitfield, devIntrSrc);
        }
    }
    else /* CPUSS_V2 */
    {
        CY_ASSERT_L1(CY_CPUSS_DISCONNECTED_IRQN != devIntrSrc); /* Disconnection feature doesn't work for CPUSS_V2 */
        #if (CY_CPU_CORTEX_M0P)
            CPUSS_CM0_SYSTEM_INT_CTL[devIntrSrc] = _VAL2FLD(CPUSS_V2_CM0_SYSTEM_INT_CTL_CPU_INT_IDX, IRQn)
                                                    | CPUSS_V2_CM0_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
        #else
            CPUSS_CM4_SYSTEM_INT_CTL[devIntrSrc] = _VAL2FLD(CPUSS_V2_CM4_SYSTEM_INT_CTL_CPU_INT_IDX, IRQn)
                                                                | CPUSS_V2_CM4_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
        #endif
    }
#endif

#if defined (CY_IP_M7CPUSS)
    CY_ASSERT_L1(CY_CPUSS_DISCONNECTED_IRQN != devIntrSrc);
    #if (CY_CPU_CORTEX_M0P)
        CPUSS_CM0_SYSTEM_INT_CTL[devIntrSrc] = _VAL2FLD(CPUSS_CM0_SYSTEM_INT_CTL_CM0_CPU_INT_IDX, IRQn)
                                                        | CPUSS_CM0_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    #else
        #if (CY_IP_M7CPUSS_VERSION == 2)
        if (0UL != CY_IS_CM7_CORE_3)
        {
            CPUSS_CM7_3_SYSTEM_INT_CTL[devIntrSrc] = _VAL2FLD(CPUSS_CM7_3_SYSTEM_INT_CTL_CPU_INT_IDX, IRQn)
                                                            | CPUSS_CM7_3_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
        }
        else if (0UL != CY_IS_CM7_CORE_2)
        {
            CPUSS_CM7_2_SYSTEM_INT_CTL[devIntrSrc] = _VAL2FLD(CPUSS_CM7_2_SYSTEM_INT_CTL_CPU_INT_IDX, IRQn)
                                                            | CPUSS_CM7_2_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
        } else
        #endif /* (CY_IP_M7CPUSS_VERSION == 2) */
        if (0UL != CY_IS_CM7_CORE_0)
        {
            CPUSS_CM7_0_SYSTEM_INT_CTL[devIntrSrc] = _VAL2FLD(CPUSS_CM7_0_SYSTEM_INT_CTL_CPU_INT_IDX, IRQn)
                                                            | CPUSS_CM7_0_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
        }
        else
        {
            CPUSS_CM7_1_SYSTEM_INT_CTL[devIntrSrc] = _VAL2FLD(CPUSS_CM7_1_SYSTEM_INT_CTL_CPU_INT_IDX, IRQn)
                                                            | CPUSS_CM7_1_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
        }
    #endif
#endif
}

#if (defined(CY_IP_M4CPUSS) && (CY_CPU_CORTEX_M0P)) || defined (CY_DOXYGEN)
void Cy_SysInt_DisconnectInterruptSource(IRQn_Type IRQn, cy_en_intr_t devIntrSrc)
{
    if (CY_CPUSS_V1)
    {
        Cy_SysInt_SetInterruptSource(IRQn, CY_CPUSS_DISCONNECTED_IRQN);
    }
    else /* CPUSS_V2 */
    {
        CPUSS_CM0_SYSTEM_INT_CTL[devIntrSrc] &= (uint32_t)~ CPUSS_V2_CM0_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
}


cy_en_intr_t Cy_SysInt_GetInterruptSource(IRQn_Type IRQn)
{
    uint32_t tempReg = CY_CPUSS_NOT_CONNECTED_IRQN;

    if (CY_CPUSS_V1)
    {
        uint32_t regPos  = ((uint32_t)IRQn >> CY_SYSINT_CM0P_MUX_SHIFT);
        if(0UL == (regPos & (uint32_t)~CY_SYSINT_MUX_REG_MSK))
        {
            uint32_t bitfield_Pos  = ((uint32_t)IRQn - (regPos <<  CY_SYSINT_CM0P_MUX_SHIFT)) <<  CY_SYSINT_CM0P_MUX_SCALE;
            uint32_t bitfield_Msk = (uint32_t)(CY_SYSINT_CM0P_MUX_MASK << bitfield_Pos);

