zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysint.c
            tempReg = _FLD2VAL(bitfield, CPUSS_CM0_INT_CTL[regPos]);
        }
    }

    return ((cy_en_intr_t)tempReg);
}
#endif

IRQn_Type Cy_SysInt_GetNvicConnection(cy_en_intr_t devIntrSrc)
{
    uint32_t tempReg = CY_CPUSS_NOT_CONNECTED_IRQN;

#if defined (CY_IP_M4CPUSS)
    #if (CY_CPU_CORTEX_M0P)
    if (CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_V2_CM0_SYSTEM_INT_CTL_CPU_INT_VALID, CPUSS_CM0_SYSTEM_INT_CTL[devIntrSrc]))
    {
        tempReg = _FLD2VAL(CPUSS_V2_CM0_SYSTEM_INT_CTL_CPU_INT_IDX, CPUSS_CM0_SYSTEM_INT_CTL[devIntrSrc]);
    }
    #else
    if ((!CY_CPUSS_V1) && (CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_V2_CM4_SYSTEM_INT_CTL_CPU_INT_VALID, CPUSS_CM4_SYSTEM_INT_CTL[devIntrSrc])))
    {
        tempReg = _FLD2VAL(CPUSS_V2_CM4_SYSTEM_INT_CTL_CPU_INT_IDX, CPUSS_CM4_SYSTEM_INT_CTL[devIntrSrc]);
    }
    #endif /* (CY_CPU_CORTEX_M0P) */
#endif

#if defined (CY_IP_M7CPUSS)
    #if (CY_CPU_CORTEX_M0P)
        if ((CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_CM0_SYSTEM_INT_CTL_CPU_INT_VALID, CPUSS_CM0_SYSTEM_INT_CTL[devIntrSrc])))
        {
            tempReg = _FLD2VAL(CPUSS_CM0_SYSTEM_INT_CTL_CM0_CPU_INT_IDX, CPUSS_CM0_SYSTEM_INT_CTL[devIntrSrc]);
        }
    #else
        #if (CY_IP_M7CPUSS_VERSION == 2)
        if (CY_IS_CM7_CORE_3 && (CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_CM7_3_SYSTEM_INT_CTL_CPU_INT_VALID, CPUSS_CM7_3_SYSTEM_INT_CTL[devIntrSrc])))
        {
            tempReg = _FLD2VAL(CPUSS_CM7_3_SYSTEM_INT_CTL_CPU_INT_IDX, CPUSS_CM7_3_SYSTEM_INT_CTL[devIntrSrc]);
        }
        else if (CY_IS_CM7_CORE_2 && (CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_CM7_2_SYSTEM_INT_CTL_CPU_INT_VALID, CPUSS_CM7_2_SYSTEM_INT_CTL[devIntrSrc])))
        {
            tempReg = _FLD2VAL(CPUSS_CM7_2_SYSTEM_INT_CTL_CPU_INT_IDX, CPUSS_CM7_2_SYSTEM_INT_CTL[devIntrSrc]);
        } else
        #endif /* (CY_IP_M7CPUSS_VERSION == 2) */
        if (CY_IS_CM7_CORE_0 && (CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_CM7_0_SYSTEM_INT_CTL_CPU_INT_VALID, CPUSS_CM7_0_SYSTEM_INT_CTL[devIntrSrc])))
        {
            tempReg = _FLD2VAL(CPUSS_CM7_0_SYSTEM_INT_CTL_CPU_INT_IDX, CPUSS_CM7_0_SYSTEM_INT_CTL[devIntrSrc]);
        }
        else if ((CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_CM7_1_SYSTEM_INT_CTL_CPU_INT_VALID, CPUSS_CM7_1_SYSTEM_INT_CTL[devIntrSrc])))
        {
            tempReg = _FLD2VAL(CPUSS_CM7_1_SYSTEM_INT_CTL_CPU_INT_IDX, CPUSS_CM7_1_SYSTEM_INT_CTL[devIntrSrc]);
        }
        else
        {
            /* No active core */
        }
    #endif
#endif
    return ((IRQn_Type)tempReg);
}


cy_en_intr_t Cy_SysInt_GetInterruptActive(IRQn_Type IRQn)
{
    uint32_t tempReg = CY_CPUSS_NOT_CONNECTED_IRQN;
    uint32_t locIdx = (uint32_t)IRQn & CY_SYSINT_INT_STATUS_MSK;

#if defined (CY_IP_M4CPUSS)
    #if (CY_CPU_CORTEX_M0P)
    if(CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_V2_CM0_INT0_STATUS_SYSTEM_INT_VALID, CPUSS_CM0_INT_STATUS[locIdx]))
    {
        tempReg = _FLD2VAL(CPUSS_V2_CM0_INT0_STATUS_SYSTEM_INT_IDX, CPUSS_CM0_INT_STATUS[locIdx]);
    }
    #else
    if (!CY_CPUSS_V1)
    {
        if(CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_V2_CM4_INT0_STATUS_SYSTEM_INT_VALID, CPUSS_CM4_INT_STATUS[locIdx]))
        {
            tempReg = _FLD2VAL(CPUSS_V2_CM4_INT0_STATUS_SYSTEM_INT_IDX, CPUSS_CM4_INT_STATUS[locIdx]);
        }
    }
    #endif /* (CY_CPU_CORTEX_M0P) */
#endif

#if defined (CY_IP_M7CPUSS)
    #if (CY_CPU_CORTEX_M0P)
        if(CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_CM0_INT0_STATUS_SYSTEM_INT_VALID, CPUSS_CM0_INT_STATUS_BASE[locIdx]))
        {
            tempReg = _FLD2VAL(CPUSS_CM0_INT0_STATUS_SYSTEM_INT_IDX, CPUSS_CM0_INT_STATUS_BASE[locIdx]);
        }
    #else
        #if (CY_IP_M7CPUSS_VERSION == 2)
        if ((CY_IS_CM7_CORE_3) && (CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_CM7_3_INT_STATUS_SYSTEM_INT_VALID, CPUSS_CM7_3_INT_STATUS[locIdx])))
        {
            tempReg = _FLD2VAL(CPUSS_CM7_3_INT_STATUS_SYSTEM_INT_IDX, CPUSS_CM7_3_INT_STATUS[locIdx]);
        }
        else if ((CY_IS_CM7_CORE_2) && (CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_CM7_2_INT_STATUS_SYSTEM_INT_VALID, CPUSS_CM7_2_INT_STATUS[locIdx])))
        {
            tempReg = _FLD2VAL(CPUSS_CM7_2_INT_STATUS_SYSTEM_INT_IDX, CPUSS_CM7_2_INT_STATUS[locIdx]);
        } else
        #endif /* (CY_IP_M7CPUSS_VERSION == 2) */
        if((CY_IS_CM7_CORE_0) && (CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_CM7_0_INT_STATUS_SYSTEM_INT_VALID, CPUSS_CM7_0_INT_STATUS[locIdx])))
        {
            tempReg = _FLD2VAL(CPUSS_CM7_0_INT_STATUS_SYSTEM_INT_IDX, CPUSS_CM7_0_INT_STATUS[locIdx]);
        }
        else if(CY_SYSINT_ENABLE == _FLD2VAL(CPUSS_CM7_1_INT_STATUS_SYSTEM_INT_VALID, CPUSS_CM7_1_INT_STATUS[locIdx]))
        {
            tempReg = _FLD2VAL(CPUSS_CM7_1_INT_STATUS_SYSTEM_INT_IDX, CPUSS_CM7_1_INT_STATUS[locIdx]);
        }
        else
        {
            /* No active core */
        }
    #endif
#endif
    return ((cy_en_intr_t)tempReg);
}

#endif


cy_israddress Cy_SysInt_SetVector(IRQn_Type IRQn, cy_israddress userIsr)
{
    cy_israddress prevIsr;

    /* Set the new vector only if it was moved to __ramVectors */
    if (SCB->VTOR == (uint32_t)&__ramVectors)
    {
        CY_ASSERT_L1(CY_SYSINT_IS_VECTOR_VALID(userIsr));

        prevIsr = __ramVectors[CY_INT_IRQ_BASE + (uint32_t)IRQn];
        __ramVectors[CY_INT_IRQ_BASE + (uint32_t)IRQn] = userIsr;

        #if defined (CY_IP_M7CPUSS)
            #if ((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE))
                // Ensure that above change in the vector table is cleaned from Data Cache,
                // and Instruction Cache is invalidated, so that CPU fetches the correct address
                SCB_CleanDCache_by_Addr((uint32_t*)&__ramVectors[CY_INT_IRQ_BASE + (uint32_t)IRQn], 4);
                SCB_InvalidateICache();
            #endif
        #endif
    }
    else
    {
        prevIsr = __Vectors[CY_INT_IRQ_BASE + (uint32_t)IRQn];
    }

    return (prevIsr);
}


cy_israddress Cy_SysInt_GetVector(IRQn_Type IRQn)
{
    cy_israddress currIsr;

    /* Return the SRAM ISR address only if it was moved to __ramVectors */
    if (SCB->VTOR == (uint32_t)&__ramVectors)
    {
        currIsr = __ramVectors[CY_INT_IRQ_BASE + (uint32_t)IRQn];
    }
    else
    {
        currIsr = __Vectors[CY_INT_IRQ_BASE + (uint32_t)IRQn];
    }

    return (currIsr);
}

