zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_sysint.c
#if (defined(CY_IP_M4CPUSS) && (!CY_CPU_CORTEX_M0P))
void Cy_SysInt_SoftwareTrig(IRQn_Type IRQn)
{
    NVIC->STIR = (uint32_t)IRQn & CY_SYSINT_STIR_MASK;
}
#endif


/* These functions are compatible with M7 and M4 CPUSSv2 that also have the CPUSS_SYSTEM_IRQ_PRESENT. */
#if defined (CY_IP_M7CPUSS) || (defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS_VERSION == 2u) && (CPUSS_SYSTEM_IRQ_PRESENT)) || defined (CY_DOXYGEN)
cy_en_sysint_status_t Cy_SysInt_InitExtIRQ(const cy_stc_sysint_t* config, cy_israddress userIsr)
{
    cy_en_sysint_status_t status = CY_SYSINT_SUCCESS;

    if(NULL != config)
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to IRQn_Type enum.');
        IRQn_Type IRQn = (IRQn_Type)((uint32_t) config->intrSrc >> CY_SYSINT_INTRSRC_MUXIRQ_SHIFT);
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_intr_t enum.');
        cy_en_intr_t devIntrSrc = (cy_en_intr_t)((uint32_t) config->intrSrc & CY_SYSINT_INTRSRC_MASK);
        CY_ASSERT_L3(CY_SYSINT_IS_PRIORITY_VALID(config->intrPriority));

    #if (CY_CPU_CORTEX_M0P)
        if (IRQn > NvicMux1_IRQn && IRQn < Internal0_IRQn)
    #else
        if (IRQn > SysTick_IRQn && IRQn < Internal0_IRQn)
    #endif
        {
            Cy_SysInt_SetInterruptSource(IRQn, devIntrSrc);
        }
        else
        {
            status = CY_SYSINT_BAD_PARAM;
        }
        NVIC_SetPriority(IRQn, config->intrPriority);

        /* Set the new vector only if it was moved to __ramVectors */
        if (SCB->VTOR == (uint32_t)&__ramVectors)
        {
            (void)Cy_SysInt_SetVector(IRQn, userIsr);
        }

    }
    else
    {
        status = CY_SYSINT_BAD_PARAM;
    }

    return(status);
}


cy_en_sysint_status_t Cy_SysInt_InitIntIRQ(const cy_stc_sysint_t* config, cy_israddress userIsr)
{
    cy_en_sysint_status_t status = CY_SYSINT_SUCCESS;

    if(NULL != config)
    {
        CY_ASSERT_L3(CY_SYSINT_IS_PRIORITY_VALID(config->intrPriority));

        if (((uint32_t)config->intrSrc >= (uint32_t)Internal0_IRQn) && ((uint32_t)config->intrSrc <= (uint32_t)Internal7_IRQn))
        {

            NVIC_SetPriority((IRQn_Type)config->intrSrc, config->intrPriority);

            /* Set the new vector only if it was moved to __ramVectors */
            if (SCB->VTOR == (uint32_t)&__ramVectors)
            {
                (void)Cy_SysInt_SetVector((IRQn_Type)config->intrSrc, userIsr);
            }
        }
        else
        {
            status = CY_SYSINT_BAD_PARAM;
        }

    }
    else
    {
        status = CY_SYSINT_BAD_PARAM;
    }

    return(status);
}

void  Cy_SysInt_SetSystemIrqVector(cy_en_intr_t sysIntSrc, cy_israddress userIsr)
{
    if (Cy_SysInt_SystemIrqUserTableRamPointer != NULL)
    {
        Cy_SysInt_SystemIrqUserTableRamPointer[sysIntSrc] = userIsr;
    }
}


cy_israddress  Cy_SysInt_GetSystemIrqVector(cy_en_intr_t sysIntSrc)
{
    cy_israddress userIsr = NULL;
    if (Cy_SysInt_SystemIrqUserTableRamPointer != NULL)
    {
        userIsr =  Cy_SysInt_SystemIrqUserTableRamPointer[sysIntSrc];
    }

    return userIsr;
}

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 14.3', 4, 'Valid Control expression conditions.')
void Cy_SysInt_EnableSystemInt(cy_en_intr_t sysIntSrc)
{
    if (CY_CPU_CORTEX_M0P)
    {
        CPUSS_CM0_SYSTEM_INT_CTL[sysIntSrc] |= CPUSS_CM0_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    #if defined (CY_IP_M7CPUSS)
    #if (CY_IP_M7CPUSS_VERSION == 2)
    else if (CY_IS_CM7_CORE_3)
    {
        CPUSS_CM7_3_SYSTEM_INT_CTL[sysIntSrc] |= CPUSS_CM7_3_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    else if (CY_IS_CM7_CORE_2)
    {
        CPUSS_CM7_2_SYSTEM_INT_CTL[sysIntSrc] |= CPUSS_CM7_2_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    #endif /* (CY_IP_M7CPUSS_VERSION == 2) */
    else if (CY_IS_CM7_CORE_0)
    {
        CPUSS_CM7_0_SYSTEM_INT_CTL[sysIntSrc] |= CPUSS_CM7_0_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    else
    {
        CPUSS_CM7_1_SYSTEM_INT_CTL[sysIntSrc] |= CPUSS_CM7_1_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    #elif (CY_IP_M4CPUSS)
    else
    {
        CPUSS_CM4_SYSTEM_INT_CTL[sysIntSrc] |= CPUSS_V2_CM4_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    #else
        #error This version of the sysint driver only supports CM4 and CM7 devices.
    #endif
}


void Cy_SysInt_DisableSystemInt(cy_en_intr_t sysIntSrc)
{
    if (CY_CPU_CORTEX_M0P)
    {
        CPUSS->CM0_SYSTEM_INT_CTL[sysIntSrc] &= (uint32_t) ~CPUSS_CM0_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    #if defined (CY_IP_M7CPUSS)
    #if (CY_IP_M7CPUSS_VERSION == 2)
    else if (CY_IS_CM7_CORE_3)
    {
        CPUSS->CM7_3_SYSTEM_INT_CTL[sysIntSrc] &= (uint32_t) ~CPUSS_CM7_3_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    else if (CY_IS_CM7_CORE_2)
    {
        CPUSS->CM7_2_SYSTEM_INT_CTL[sysIntSrc] &= (uint32_t) ~CPUSS_CM7_2_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    #endif /* (CY_IP_M7CPUSS_VERSION == 2) */
    else if (CY_IS_CM7_CORE_0)
    {
        CPUSS->CM7_0_SYSTEM_INT_CTL[sysIntSrc] &= (uint32_t) ~CPUSS_CM7_0_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    else
    {
        CPUSS->CM7_1_SYSTEM_INT_CTL[sysIntSrc] &= (uint32_t) ~CPUSS_CM7_1_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    #elif (CY_IP_M4CPUSS)
    else
    {
        CPUSS->CM4_SYSTEM_INT_CTL[sysIntSrc] &= (uint32_t) ~CPUSS_CM4_SYSTEM_INT_CTL_CPU_INT_VALID_Msk;
    }
    #else
        #error This version of the sysint driver only supports CM4 and CM7 devices.
    #endif
}
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 14.3')

#endif  /* defined (CY_IP_M7CPUSS) || (defined (CY_IP_M4CPUSS) && (CY_IP_M4CPUSS_VERSION == 2u) && (CPUSS_SYSTEM_IRQ_PRESENT)) || defined (CY_DOXYGEN) */

#endif  /* defined (CY_IP_M4CPUSS) || defined (CY_IP_M7CPUSS) */

/* [] END OF FILE */
